Revit 2027 API
ParameterTypeId.ContinuousrailEndTerminationAttachmentParam Property
 "Extension Style"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ContinuousrailEndTerminationAttachmentParam { get; }
Public Shared ReadOnly Property ContinuousrailEndTerminationAttachmentParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ContinuousrailEndTerminationAttachmentParam {
	ForgeTypeId^ get ();
}
static member ContinuousrailEndTerminationAttachmentParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace